[
  {
    "name": "Международный женский день",
    "description": "Междунаро́дный же́нский день — праздник, отмечаемый ежегодно 8 марта в ряде стран как «женский день». Исторически появился как день солидарности женщин во многих странах в борьбе за равные права и эмансипацию. С марта 1975 года Международный женский день отмечается в ООН.",
    "message": "123",
    "date": {
      "day": 8,
      "month": 3
    },
    "category": "General holidays",
    "icon": "",
    "notify": true
  },
  {
    "name": "Международный день защиты детей",
    "description": "Решение о проведении Международного дня защиты детей было принято на Всемирной конференции, посвященной вопросам благополучия детей, которая состоялась в Женеве в 1925 году. Почему этот детский праздник было решено отмечать именно 1 июня? По одной из версий, 1 июня 1925 года Генеральный консул Китая в Сан-Франциско собрал группу китайских детей-сирот и устроил для них празднование Дуань-у цзе (Фестиваля лодок-драконов). По счастливой случайности этот день совпал и со временем проведения «детской» конференции в Женеве.\n\nПосле Второй мировой войны, когда проблемы сохранения здоровья и благополучия детей были как никогда актуальны, в 1949 году в Париже состоялся конгресс женщин, на котором прозвучала клятва о безустанной борьбе за обеспечение прочного мира, как единственной гарантии счастья детей. Через год, 1 июня 1950-года, был проведен первый Международный день защиты детей, после чего этот праздник проводится ежегодно.",
    "message": "Международный день защиты детей отмечается ежегодно более чем в 30 странах мира и является одним из наиболее старых международных праздников. Решение о его проведении было принято в 1925 году на Всемирной конференции в Женеве, посвященной вопросам благополучия детей. Впервые день защиты детей был проведен в 1950 году в 51 стране мира. ООН поддержала эту инициативу и объявила защиту прав, жизни и здоровья детей одним из приоритетных направлений своей деятельности.",
    "date": {
      "day": 1,
      "month": 6
    },
    "category": "General holidays",
    "icon": "",
    "notify": false
  },
  {
    "name": "Рождество (по Юлианскому календарю)",
    "description": "Во всем мире Рождество празднуют 25 декабря, только некоторые страны, которые находятся под православным влиянием, продолжают праздновать Рождество по, так званому, старому стилю - 7 Января. Вся эта суета из-за того, что православная церковь использует давно устаревший Юлианский календарь, введённый Юлием Цезарем. Европа отказалась от Юлианского календаря из-за его погрешностей более 500 лет назад, и в 1582 году перешла на более точный Григорианский календарь. По Юлианскому календарю Рождество выпадает на 7 Января, а Новый год - 14. Например, в Украине можно наблюдать такой парадокс: люди празднуют Рождество (когда родился Иисус) по устаревшему Юлианскому календарю, а Новый год (когда Иисусу дали Имя) - по современному Григорианскому. Парадокс заключается в том, что Новый год получился перед Рождеством.",
    "message": "С Рождеством Христовым! Пусть этот волшебный праздник наполнит вашу жизнь светом, теплом, радостью и благополучием. Желаем вам мира, добра, любви, семейного уюта.",
    "date": {
      "day": 7,
      "month": 1
    },
    "category": "Religious holiday",
    "icon": "",
    "notify": true
  },
  {
    "name": "День программиста",
    "description": "Праздник программистов, отмечаемый в 256-й день года. Число 256 выбрано потому, что это количество различных значений, которые можно выразить с помощью восьмиразрядного байта. Также это максимальная целая степень числа 2, которая не превышает количества дней в году.",
    "message": "В век технологий и прогресса мы особенно празднуем день программистов! Пожелаем не останавливаться надостигнутом!",
    "date": {
      "day": 13,
      "month": 9
    },
    "category": "Professional Holiday",
    "icon": "",
    "notify": true
  },
  {
    "name": "День учителя",
    "description": "День учителя — профессиональный праздник работников сферы образования — отмечается в ряде стран постсоветского пространства в первое воскресенье октября.\n\nСвою историю он ведёт с 1965 года, когда, в эпоху существования СССР, отмечался повсеместно во всех Республиках Советского Союза согласно Указу Президиума Верховного Совета СССР от 1 октября 1980 года «О праздничных и памятных датах».\n\nУчитель — это не только человек, обучающий наукам, но еще и носитель духовности и нравственного начала. Учителя выполняют особую гражданскую миссию — воспитание молодого поколения. Их знания и опыт, преемственность традиций и новаторство лежат в основе каждой школы.\n\nСегодня хочется пожелать всем учителям доброго здоровья, мира, благополучия. А также неустанного поиска истины и знания, взаимопонимания в коллективе и благодарных, любознательных учеников!",
    "message": "День учителя — один из самых любимых профессиональных праздников. В этот день учителя принимают поздравления от своих воспитанников, которые дарят им подарки.",
    "date": {
      "day": 5,
      "month": 10
    },
    "category": "Professional Holiday",
    "icon": "",
    "notify": true
  },
  {
    "name": "Международный день музыки",
    "description": "Праздник отмечается ежегодно во всем мире большими концертными программами, с участием лучших артистов и художественных коллективов. В этот день звучат сочинения, вошедшие в сокровищницу мировой культуры. Также проходят творческие встречи с композиторами, исполнителями, музыковедами, организуются тематические выставки и акции просветительского характера, что способствует цели распространения музыки как искусства в самых разных сообществах.\n\nМузыка — вид искусства, в котором средством воплощения художественных образов служат определенным образом организованные музыкальные звуки. \n\nВ 2000 году китайские археологи обнаружили музей музыкальных инструментов, созданных две тысячи лет назад, в эпоху династии Хань.\n\nМузыка обладает огромной силой. На свете найдется мало людей, равнодушных к музыке. Многие композиторы пытались выразить через нее состояние своей души. Их великие имена всегда с благодарностью будут произносить потомки. Музыка не стареет, она будет жить столько, сколько будет существовать человек.",
    "message": "",
    "date": {
      "day": 1,
      "month": 10
    },
    "category": "General holidays",
    "icon": "",
    "notify": false
  },
  {
    "name": "Праздник весны и труда",
    "description": "1 мая во многих странах мира отмечается международный праздник — День труда (Праздник Весны и Труда), который изначально носил название День международной солидарности трудящихся.\n\n1 мая 1886 года американские рабочие организовали забастовку в Чикаго, выдвинув требование 8-часового рабочего дня. Забастовка и сопутствующая демонстрация закончились кровопролитным столкновением с полицией.\n\nВ июле 1889 года Парижский конгресс II Интернационала в память о выступлении рабочих принял решение о проведении 1 мая ежегодных демонстраций. Впервые день международной солидарности трудящихся был отмечен в 1890 году в Австро-Венгрии, Бельгии, Германии, Дании, Испании, Италии, США, Норвегии, Франции, Швеции и некоторых других странах.\n\n\nДолгое время Первомай был символом революции, непримиримой классовой борьбы, имел «политическую окраску» и отмечался демонстрациями, украшенными портретами политических деятелей, передовиков производства, лозунгами, призывами, плакатами и диаграммами о достижениях в той или иной отрасли народного хозяйства, науки, культуры. Но постепенно этот контекст терялся.\n\nСегодня праздник отмечается в 142 странах и территориях мира 1 мая или в первый понедельник мая. Для ряда стран традиция собирать людей под знамена профсоюзов еще сохранилась, но в большинстве государств это все же не политический праздник, а именно День труда, яркий весенний праздник, когда организуются народные гуляния, выступления артистов, ярмарки, мирные шествия и множество увеселительных мероприятий. А для кого-то это просто еще один выходной, в течение которого можно отдохнуть или провести время с семьей.",
    "message": "1 мая во многих странах мира отмечается международный праздник — День труда (Праздник Весны и Труда), который изначально носил название День международной солидарности трудящихся.",
    "date": {
      "day": 1,
      "month": 5
    },
    "category": "General holidays",
    "icon": "",
    "notify": true
  },
  {
    "name": "День Победы в войне над фашистской Германией",
    "description": "9 мая — День Победы в войне над фашистской Германией — является в России, бывших советских республиках и многих странах Европы одним из самых важных, трогательных и славных праздников.\n\nВ Берлинской операции 1945 года, которая стала завершающей в Великой Отечественной войне, были задействованы свыше 2,5 миллионов солдат и офицеров, 6250 танков и самоходных орудий, 7500 самолетов. Потери оказались огромными: по официальным данным, за сутки Красная Армия теряла более 15 тысяч солдат и офицеров. Всего в Берлинской операции советские войска потеряли 352 тысячи человек.\n\n9 мая 1945 года на Центральный аэродром имени Фрунзе приземлился самолет «Ли-2» с экипажем А.И. Семенкова, доставивший в Москву акт о капитуляции фашистской Германии. А 24 июня на Красной площади в Москве состоялся Парад Победы.",
    "message": "Война всегда начинается внезапно, хотя спустя поколение для историков она покажется неизбежной. В 1941 году началась самая страшная, самая близкая, самая дорогая — Великая Отечественная война. ",
    "date": {
      "day": 9,
      "month": 5
    },
    "category": "General holidays",
    "icon": "",
    "notify": true
  },
  {
    "name": "День народного единства",
    "description": "День народного единства отмечается ежегодно 4 ноября, начиная с 2005 года. Этот государственный праздник установлен в честь важного события в истории России — освобождения Москвы от польских интервентов в 1612 году, и приурочен к Дню Казанской иконы Божией Матери.\n\nИсторически этот праздник связан с окончанием Смутного времени на Руси — периода со смерти царя Ивана Грозного и до 1613 года, когда на русский престол взошел первый из династии Романовых.\n\nСмутное время — эпоха глубокого кризиса Московского государства, когда единое русское государство распалось, появились многочисленные самозванцы. Власть в Москве узурпировала «семибоярщина» во главе с князем Федором Мстиславским, пустившая в Кремль польские войска с намерением посадить на русский престол католического королевича Владислава.\n\nВ это тяжелое для страны время патриарх Гермоген призвал русский народ встать на защиту Родины, своей веры и изгнать польских захватчиков. Русские люди подхватили призыв, и вскоре началось широкое патриотическое движение за освобождение столицы. Народное ополчение возглавили князь Дмитрий Пожарский и купец Кузьма Минин. С чудотворной иконой Казанской Божией Матери Нижегородское земское ополчение сумело 4 ноября 1612 года взять штурмом Китай-город и изгнать поляков из Москвы. Эта победа послужила мощным импульсом для возрождения русского государства, а икона стала предметом особого почитания.\n",
    "message": "16 декабря 2004 года Госдума РФ приняла одновременно в трех чтениях поправки в Федеральный закон «О днях воинской славы (Победных днях России)». Одной из правок было введение нового праздника — Дня народного единства — и фактическое перенесение государственного выходного дня с 7 ноября (День согласия и примирения) на 4 ноября.",
    "date": {
      "day": 4,
      "month": 11
    },
    "category": "General holidays",
    "icon": "",
    "notify": true
  },
  {
    "name": "День матери",
    "description": "Невозможно поспорить с тем, что этот праздник — праздник вечности. Из поколения в поколение для каждого человека мама — самый главный человек в жизни. Становясь матерью, женщина открывает в себе лучшие качества: доброту, любовь, заботу, терпение и самопожертвование.\n\nС каждым годом День матери становится всё популярнее в российском обществе. И это замечательно: сколько бы хороших, добрых слов мы не говорили своим мамам, сколько бы поводов для этого ни придумали, лишними они не будут.\n\nОсобо красиво и незабываемо проходят различные мероприятия, посвященные этому Дню, в детских дошкольных и образовательных учреждениях, где дети дарят своим мамам не только добрые слова и улыбки, но множество подарков, сделанных своими руками, и специально подготовленные концертные номера.",
    "message": "Мама — первое слово,\nГлавное слово в каждой судьбе.\nМама жизнь подарила,\nМир подарила мне и тебе.",
    "date": {
      "day": 29,
      "month": 11
    },
    "category": "General holidays",
    "icon": "",
    "notify": true
  },
  {
    "name": "День Конституции Российской Федерации",
    "description": "День Конституции Российской Федерации, который отмечается ежегодно 12 декабря, — одна из значимых памятных дат российского государства.\n\nВ этот день в 1993 году всенародным голосованием была принята Конституция Российской Федерации. Полный текст Конституции был опубликован в «Российской газете» 25 декабря 1993 года. С 1994 года, согласно Указам Президента России («О Дне Конституции Российской Федерации» и «О нерабочем дне 12 декабря») день 12 декабря был объявлен государственным праздником.\n\nКонституция — основной закон государства — является ядром всей правовой системы России и определяет смысл и содержание других законов.\n\n\nВ конце 1990-х годов российская Конституция пережила, по меньшей мере, два политических кризиса, из которых вышла с честью и достоинством. Ей предшествовали принятая в 1918 году конституция РСФСР и первая Конституция СССР, принятая в 1924 году и закрепившая победу социализма на советском пространстве. Затем на смену пришли Конституция 1936 года и, так называемая, «брежневская» Конституция 1977 года, действовавшая до распада Советского Союза.\n\nРоссийская Конституция — прочный фундамент демократического развития российского государства. Это не просто декларация добрых намерений, это реально работающий документ прямого действия. Конституция для гражданина любой страны — Закон, который он должен знать в первую очередь, ведь знание и грамотное применение законов — норма цивилизованной жизни, мощный рычаг для повышения её качества.",
    "message": "В этот день в 1993 году всенародным голосованием была принята Конституция Российской Федерации. Полный текст Конституции был опубликован в «Российской газете» 25 декабря 1993 года.",
    "date": {
      "day": 12,
      "month": 12
    },
    "category": "General holidays",
    "icon": "",
    "notify": true
  },
  {
    "name": "День святого Валентина",
    "description": "День свято́го Валенти́на, или День всех влюблённых — праздник католического происхождения, который отмечается 14 февраля во многих странах мира. Назван по имени одного из двух раннехристианских мучеников с именем Валентин — Валентин Интерамнский и Валентин Римский.",
    "message": "С праздником! Пусть любовь живет в сердце и греет теплом.",
    "date": {
      "day": 14,
      "month": 2
    },
    "category": "General holidays",
    "icon": "",
    "notify": true
  },
  {
    "name": "Новый год!",
    "description": "Новый год– это самый любимый праздник большинства взрослых и детей, ведь в ночь с 31 декабря на 1 января случаются самые настоящие чудеса!\nС нетерпением, волнением и радостью люди ждут наступления торжественной ночи. Подготовка к празднику начинается заранее, и к концу декабря уже вовсю сверкают огнями улицы городов, а в каждом доме стоит наряженная елка.\n\nКорнями история празднования Нового Года уходит в Месопотамию, где зародилась традиция отмечать весеннее пробуждение природы, происходило это в марте месяце. Уже тогда веселье длилось больше недели. Никто в эти дни не работал, люди ходили на гуляния и веселые маскарады.\nПозже обычай встречать Новый Год переняли греки, затем египтяне и римляне.\nВ России Новый Год не всегда отмечали в ночь с 31 декабря на 1 января.\nНа какую дату выпадал этот праздник у язычников, до крещения Руси, неизвестно до сих пор, однако фактом является то, что празднование Нового Года совпадало с окончанием зимы.\nС появлением нового летоисчисления, связанного с крещением Руси, за праздником закрепилась дата 1 марта, позже она передвинулась на 1 сентября.\nВ 1699 году царь Петр I издал указ о праздновании Нового Года 1 января. Это было сделано по примеру всех европейских стран, живших по григорианскому календарю.\nДо настоящего времени праздник в России отмечают 1 января.",
    "message": "Желаем, чтобы этот год для вас был ярким, запоминающимся, благополучным, добрым и удачным. С Новым годом!",
    "date": {
      "day": 1,
      "month": 1
    },
    "category": "General holidays",
    "icon": "",
    "notify": true
  },
  {
    "name": "День защитника Отечества",
    "description": "23 февраля отмечается День воинской славы России — День защитника Отечества. Эта дата установлена Федеральным законом «О днях воинской славы и памятных датах России», принятым Государственной думой и подписанным президентом РФ Б.Ельциным 13 марта 1995 года.\n\nВ СССР было принято считать, что 23 февраля 1918 года отряды Красной гвардии одержали свои первые победы под Псковом и Нарвой над регулярными войсками кайзеровской Германии. Эти первые победы и стали «днём рождения Красной Армии».\n\n\nВ 1922 году эта дата была официально объявлена Днём Красной Армии. Позднее 23 февраля ежегодно отмечался в СССР как всенародный праздник — День Советской Армии и Военно-Морского Флота.\n\n10 февраля 1995 года Государственная Дума РФ приняла Федеральный закон «О днях воинской славы (победных днях) России», в котором дата 23 февраля имела следующее название: «День победы Красной армии над кайзеровскими войсками Германии (1918 год) — День защитников Отечества».",
    "message": "Сегодня это праздник всех тех, кто защищал, защищает и готов защищать Отечество",
    "date": {
      "day": 23,
      "month": 2
    },
    "category": "General holidays",
    "icon": "",
    "notify": true
  },
  {
    "name": "День России",
    "description": "Важный государственный праздник Российской Федерации, отмечаемый ежегодно 12 июня. До 2002 года он именовался как День принятия Декларации о государственном суверенитете России. Это один из самых «молодых» государственных праздников в стране.\n\n12 июня 1990 года первый Съезд народных депутатов РСФСР принял Декларацию о государственном суверенитете России, в которой было провозглашено главенство Конституции России и её законов. К тому времени многие республики СССР уже приняли решение о своем суверенитете, поэтому данный документ принимался в условиях, когда республики одна за другой становились независимыми. Важной вехой в укреплении российской государственности стало принятие нового названия страны – Российская Федерация (Россия).\n\nКстати, именно 12 июня помимо «независимости» Россия обрела и первого Президента – в этот день, но уже в 1991 году, состоялись первые в истории страны всенародные открытые выборы президента, на которых одержал победу Б.Н. Ельцин. Именно он своим указом № 1113 от 2 июня 1994 года придал 12 июня государственное значение, а сам праздник получил название – День принятия Декларации о государственном суверенитете Российской Федерации. Позже, для простоты, его стали называть Днем независимости.\n\nНо первая попытка создать главный государственный праздник, который бы ознаменовал начало отсчета новой истории России, оценивалась неоднозначно. В народе он толковался по-разному, а опросы населения тех лет наглядно демонстрировали полное отсутствие понимания у россиян сути праздника. Для большинства 12 июня стало еще одним выходным днем, когда можно поехать куда-нибудь на отдых или на дачу. Хотя в ряде российских городов проводились праздничные мероприятия, но особого размаха не наблюдалось.\n\nВ своем выступлении в честь данного праздника в 1998 году Борис Ельцин попробовал раз и навсегда прекратить кривотолки относительно 12 июня, предложив отмечать его как День России. Официально новое название праздник получил 1 февраля 2002 года, когда в силу вступили положения нового Трудового кодекса РФ.\n\nЕще в 2001 году, выступая в Кремле на торжественном приеме по случаю Дня принятия Декларации о государственном суверенитете России, Президент РФ В.В. Путин сказал, что: «С этого документа начался отсчет нашей новой истории. Истории демократического государства, основанного на гражданских свободах и верховенстве закона. А его главный смысл — это успех, достаток и благополучие граждан».",
    "message": "День России – важный государственный праздник Российской Федерации, отмечаемый ежегодно 12 июня. До 2002 года он именовался как День принятия Декларации о государственном суверенитете России.",
    "date": {
      "day": 12,
      "month": 6
    },
    "category": "General holidays",
    "icon": "",
    "notify": true
  },
  {
    "name": "День отца ",
    "description": "День отца – праздник посвященный отцам. В торжестве принимают участие отцы, матери, их дети, родственники, близкие друзьям и семьи, планирующие рождение ребенка. К ним присоединяются те, кто по профилю своей деятельности связан с планированием семьи, благотворительные и правозащитные организации соответствующей специализации.\n\nВ России День отца ежегодно празднуется в третье воскресенье июня. В 2021 году торжество приходится на 20 июня. Праздник пока не закреплен на государственном уровне.\n\nСуть праздника – выразить благодарность отцам за их вклад в воспитание детей.\n\nВ этот день устраиваются фестивали, концерты, благотворительные акции. Административные органы и общественные организации поздравляют отцов с их праздником и вручают и награждают их почетными знаками. В семьях дети дарят папам подарки, устраивают домашние посиделки и вылазки на природу.\n\nСобытие берёт начало в XX веке. Жительница США Сонора Додд решила проводить подобные чествования, будучи впечатлённой своим отцом. Он самостоятельно воспитывал шестерых детей после смерти их матери. Для чад папа стал образцом заботы и внимания. В знак благодарности женщина выступила с инициативой почитания мужчин.\n\nПредложение, обращённое в адрес мэра города, было воспринято с энтузиазмом. В 1910 году впервые торжества прошли на территории населённого пункта Споукейн. Спустя десятилетия Президент Соединённых Штатов Л. Джонсон при поддержке Конгресса закрепил на законодательном уровне этот праздник, предписав справлять его в третье воскресенье июня.\n\nВскоре американская традиция получила широкое распространение во многих странах мира. На территории России этот праздник появился недавно и не является официальным. В некоторых регионах торжество утверждено на законодательном уровне. В 2002 году этот праздник был принят местными властями в Череповце, а в 2003 в Новосибирске. В 2006 году торжество утвердили в Липецкой, Ульяновской, Курской и Волгоградской областях. В 2009 году в Архангельской области появился областной праздник – День отца.",
    "message": "День отца – праздник посвященный отцам. В торжестве принимают участие отцы, матери, их дети, родственники, близкие друзьям и семьи, планирующие рождение ребенка.",
    "date": {
      "day": 20,
      "month": 6
    },
    "category": "General holidays",
    "icon": "",
    "notify": true
  },
  {
    "name": "День знаний",
    "description": "Это первые звонки и волнения, море цветов и белых бантов, и, конечно, традиционные уроки мира. Это самый долгожданный день для тех, кто впервые переступит школьный порог.\n\nЭтот праздник появился в советское время. Официально как «День знаний» он был учреждён Указом Президиума Верховного Совета СССР № 373-11 от 15 июня 1984 года «Об объявлении 1 сентября всенародным праздником — Днем знаний», который дополнил Указ Президиума Верховного Совета СССР № 3018-Х «О праздничных и памятных днях» от 1 октября 1980 года новым праздничным днём.\n\n\n1 сентября и сегодня — праздник начала нового учебного года, прежде всего для учеников, учащихся, студентов, учителей и преподавателей. Традиционно в этот день в школах проходят торжественные линейки, посвященные началу учебного года. С особой торжественностью встречают в школах первоклассников.",
    "message": "Для кого-то этот день — возвращение памяти в прошлое, для кого-то — шаг в будущее",
    "date": {
      "day": 1,
      "month": 9
    },
    "category": "General holidays",
    "icon": "",
    "notify": true
  },
  {
    "name": "День Государственного флага Российской Федерации",
    "description": "Ежегодно 22 августа в России отмечается День Государственного флага Российской Федерации, установленный на основании Указа Президента РФ № 1714 от 20 августа 1994 года.\n\n22 августа 1991 года над Белым домом в Москве впервые был официально поднят трехцветный российский флаг, заменивший в качестве государственного символа красное полотнище с серпом и молотом. В этот день на Чрезвычайной сессии Верховного Совета РСФСР было принято постановление считать «полотнище из... белой, лазоревой, алой полос» официальным национальным флагом России.\n\nСегодня флаг России — «государственный триколор» — официальный государственный символ, наряду с гербом и гимном Российской Федерации. Флаг представляет собой прямоугольное полотнище из трёх равновеликих горизонтальных полос: верхней — белого, средней — синего и нижней — красного цвета. Отношение ширины флага к его длине составляет 2:3.\n\n\nСчитается, что впервые бело-сине-красный флаг был поднят в царствование Алексея Михайловича на первом русском военном корабле «Орёл», построенном в 1667-1669 годах на Дединовской верфи.\n\nЗаконным же «отцом» триколора признан Петр I. (20) 31 января 1705 года он издал Указ, согласно которому «на торговых всяких судах» должны поднимать бело-сине-красный флаг, сам начертал образец и определил порядок горизонтальных полос.\n\nНо официальный статус флаг приобрел только в 1896 году, когда накануне коронации Николая II министерство юстиции определило, что национальным должен «окончательно считаться бело-сине-красный цвет, и никакой другой».\n\nДо сих пор историки и исследователи не пришли к единому мнению, почему были выбраны именно эти цвета для российского флага, но считается, что с самого начала каждый цвет флага имел свой смысл. По одной из версий, белый означает свободу, синий — Богородицу, покровительствующую России, красный — державность. Другая версия гласит, что белый символизирует благородство и чистоту, синий — честность и верность, а красный — смелость, мужество и великодушие, присущие русским людям, а также — это цвет крови, пролитой за Отечество.\n\nВ апреле 1918 года советское правительство по инициативе Якова Свердлова приняло решение упразднить триколор и заменить его на революционно-красное полотнище, и более 70 лет государственным флагом являлся красный стяг. 22 августа 1991 года российские парламентарии отменили вердикт коммунистов, благодаря чему историческое знамя заняло свое почетное место в официальных и торжественных событиях Российской Федерации.",
    "message": "22 августа 1991 года над Белым домом в Москве впервые был официально поднят трехцветный российский флаг, заменивший в качестве государственного символа красное полотнище с серпом и молотом.",
    "date": {
      "day": 22,
      "month": 8
    },
    "category": "General holidays",
    "icon": "",
    "notify": true
  },
  {
    "name": "Масленица — начало сырной недели",
    "description": "Масленица — древний славянский праздник с многочисленными обычаями, через века дошедший до наших дней. Отмечается в течение недели перед Великим постом. Масленица в 2021 году отмечается с 8 по 14 марта.\n\nМасленица — это веселые проводы зимы, озаренные радостным ожиданием близкого тепла, весеннего обновления природы. Главными атрибутами праздника традиционно были — чучело Масленицы, забавы, катание на санях, гулянья и, конечно же, блины — круглые, румяные, горячие, раньше они имели ритуальное значение, поскольку являли собой символ солнца, которое все ярче разгоралось, удлиняя дни.\n\nВозможно, блины были и частью поминального обряда, так как суббота перед масленицей почиталась как «родительский день» — славяне поклонялись душам усопших предков.\n\n\nПроходили века, менялась жизнь, с принятием на Руси христианства появились новые, церковные праздники, но широкая Масленица продолжала жить. Её встречали и провожали с той же неудержимой удалью, что и в языческие времена.\n\nКстати, одно время царь Алексей Михайлович самыми строгими мерами старался утихомирить своих разудалых подданных. Воеводы рассылали по градам и весям царские указы, то запрещая частное винокурение, то требуя, чтобы россияне в азартные игры не играли, кулачных боев не проводили. Но ни грозные царские указы, ни наставления патриарха не в силах были совладать с бьющим через край весельем.\n\nНа каждый день масленой недели существовали определенные обряды. В понедельник — встреча Масленицы, во вторник — заигрыши. На лакомки, то есть в среду масленой недели, тещи приглашали на блины зятьев с женами. Особенно этот обычай соблюдался в отношении молодых, недавно поженившихся. Наверняка отсюда и пошло выражение «к теще на блины».\n\nВ широкий четверг происходили самые людные санные катания. В пятницу — тещины вечерки — зятья звали тещу на угощение. Суббота отводилась золовкиным посиделкам.\n\nВоскресенье называлось «прощеным воскресеньем» или «прощеным днём». В этот день все навещали родственников, друзей и знакомых, обменивались поцелуями, поклонами и просили прощения друг у друга, если обидели словами или поступками. А также в последний день масленичной недели обязательно проводился ритуал проводов Масленицы с обязательным сожжением чучела Масленицы.",
    "message": "Масленица — древний славянский праздник с многочисленными обычаями, через века дошедший до наших дней. Отмечается в течение недели перед Великим постом. ",
    "date": {
      "day": 8,
      "month": 3
    },
    "category": "Traditional holidays",
    "icon": "",
    "notify": true
  },
  {
    "name": "Всемирный день «The Beatles»",
    "description": "Imagine there's no countries\nIt isn't hard to do\nNothing to kill or die for\nAnd no religion too\nImagine all the people living life in peace...\n\nСегодня из колонок и наушников настоящих меломанов звучат «Yesterday», «Yellow Submarine», «Let It Be» и другие творения одной из самых популярных музыкальных групп всех времен и народов — легендарной четверки из Ливерпуля. С 2001 года по решению ЮНЕСКО 16 января отмечается Всемирный день «The Beatles» (World Beatles Day).\n\nДата, конечно, выбрана не случайно. 16 января 1957 года в Ливерпуле открылся клуб «The Cavern», где начали свой путь к славе тогда еще никому не известные молодые музыканты Джон Леннон, Пол Маккартни и Джордж Харрисон. Спустя несколько лет к ним присоединился еще один будущий «битл» — Ринго Старр.\n\n\nПозже 16 января случилось еще одно знаменательное событие в истории «The Beatles»: в этот день в 1964 году журнал «Cashbox» присвоил песне «I Want To Hold Your Hand» первое место в американском хит-параде, после того как этот сингл разошелся миллионным тиражом всего за 10 дней.\n\nВ привычном составе «The Beatles» отработали восемь лет. За это время они официально выпустили 13 альбомов, каждая песня из которых становилась настоящим хитом. Начав с подражания классикам американского рок-н-ролла (большое влияние на четверку оказало, например, творчество Элвиса Пресли), «The Beatles» пришли к собственному стилю.\n\nВсемирное признание группа получила в 1963 году после выпуска сингла «Please Please Me». С этого момента на планете началось сумасшествие, получившее говорящее название «битломания».\n\nГруппа оказала большое влияние на развитие мировой музыки. Многие известные композиторы и исполнители брали с них пример. Кроме того, «битлы» впервые использовали некоторые новаторские разработки в области звукозаписи и съемок видеоклипов.\n\nПо версии журнала «Rolling Stone», группа «The Beatles» занимает первое место в списке величайших исполнителей всех времен. В декабре 2015 года клуб «The Cavern» передал в дар городу Ливерпулю памятник музыкантам, который изобразил легендарную четверку идущей вдоль набережной.\n\n16 января, в честь этой знаменитой группы, проводятся различные памятные мероприятия и кавер-концерты песен британской четвёрки, а меломаны всего мира вновь включают песни, полюбившиеся людям всех возрастов, чтобы в очередной раз насладиться творчеством «Битлов».",
    "message": "Сегодня, 16 января, из колонок и наушников настоящих меломанов звучат «Yesterday», «Yellow Submarine», «Let It Be» и другие творения одной из самых популярных музыкальных групп всех времен и народов — легендарной четверки из Ливерпуля.",
    "date": {
      "day": 16,
      "month": 1
    },
    "category": "Cultural Holiday",
    "icon": "",
    "notify": true
  },
  {
    "name": "Праздник бога Эбису, покровителя рыбаков и торговцев",
    "description": "9 января в некоторых крупных японских городах начинается трехдневный праздник-шествие в честь бога Эбису — одного из семи богов счастья и удачи. Эбису считается богом богатства, покровителем рыбаков и торговцев.\n\nПредание гласит, что богиня Солнца направила Эбису на Землю и превратила в рыбака, чтобы он сам добывал себе хлеб насущный. Поэтому-то Эбису издавна считается покровителем людей этих профессий, став их символом удачи. Бога Эбису изображают с удочкой в правой руке, а под мышкой левой руки он удерживает большого морского леща. Лицо бога Эбису всегда излучает невероятную радость и счастье.\n\nВ этот день торговцы, владельцы магазинов и все те, кто охотится за удачей и богатством, выстраиваются в шествие и отправляются по главной улице города к храму, чтобы поклониться своему покровителю.\n\nСамые крупные шествия в эти дни проходят в Осаке – известном городе торговцев, в древней столице Японии — Киото и в одном из главных городов острова Кюсю — Фукуоке. В центре шествия на больших и празднично украшенных носилках несут фигуру бога Эбису, следом едет повозка с музыкантами, вдоль процессии идут барабанщики и зазывалы. На улицы выходит более миллиона людей, и город постепенно утопает в шуме праздничной суеты.\n\nВ Фукуоке, например, одним из привлекающих элементов праздника можно назвать шествие гейш, которые возносят богу Эбису молитвы, прося у него удачи во всех начинаниях. Символом доброй удачи считаются ветви бамбука, которые в дни праздника можно купить в Японии повсюду. Участники шествия, раздающие бамбуковые ветви, обещают: «Приобретайте эти ветви, и ваш бизнес всегда будет процветать!».\n\nПомимо бамбука, распродаются и разнообразные талисманы — сумки из рисовой соломки, барабаны, небольшие бамбуковые грабельки «для загребания богатства». Эти талисманы прикрепляются к бамбуковым ветвям. Считается, что чем больше талисманов — тем больше будет денег и оживленнее пойдет торговля.\n\nКстати, японцы очень уважительно относятся к богам, которые хранят их дома и способствуют удаче. Бога Эбису непременно величают Эбису-сама — господин Эбису.",
    "message": "Предание гласит, что богиня Солнца направила Эбису на Землю и превратила в рыбака, чтобы он сам добывал себе хлеб насущный. Поэтому-то Эбису издавна считается покровителем людей этих профессий, став их символом удачи.",
    "date": {
      "day": 9,
      "month": 1
    },
    "category": "Carnivals and festivals",
    "icon": "",
    "notify": true
  },
  {
    "name": "Фестиваль бумажных змеев в Индии",
    "description": "Бумажные змеи всех возможных расцветок, форм и размеров взлетают в голубое зимнее небо Индии.\n\nБумажные змеи, несомненно, стали одним из воплощений мечты человека о полетах в небо. История создания и развития бумажных змеев впечатляет своей протяженностью и завораживает своей насыщенностью. Поэтому неслучайно фестивали бумажных змеев проводятся во многих странах мира и привлекают и любителей, и профессионалов этого искусства.\n\nВ Индии Международный фестиваль бумажных змеев (International Kite Festival) проводится ежегодно 14 января. Местом проведения выбран город на западе Индии, Ахмедабад (Ahmedabad), который является крупнейшим городом штата Гуджарат (Gujarat). По времени проведения фестиваль совпадает с фестивалем Макар Санкранти (Makar Sankranti) или Уттараян (Uttarayan) — фестивалем, воспевающим передвижение солнца в северное полушарие и смену времен года, а, следовательно, окончание зимы и приход весны.\n\n\nОкончание зимнего сезона — время проведения Международного фестиваля бумажных змеев — знаменательно голубым и безоблачным небом, запахами весенней природы, приносимыми прохладным ветром, чувствами ожидания, радости и ликования, которые охватывают всех, кто стремится посетить фестиваль.\n\nЕсли говорить точнее, то фестивали бумажных змеев проводятся во многих больших городах Гуджарата, но Международный фестиваль бумажных змеев в Ахмедабаде исторически занимает особое место, потому что именно в Ахмедабаде зародились истоки празднования Уттараяны.\n\nНа Международный фестиваль бумажных змеев в Ахмедабад собираются профессионалы и любители, производители бумажных змеев и эксперты не только из Индии, но практически со всех уголков мира. Дизайн, расцветка, размеры изделий буквально поражают воображение своим разнообразием. А среди участников можно встретить как молодежь, так и убеленных сединой пожилых людей. На фестиваль приезжают семьями, компаниями друзей и сослуживцев. Многочисленные зрители наблюдают шоу не только со специально оборудованных площадок на земле, но и с крыш своих домов или ближайших зданий.",
    "message": "Бумажные змеи всех возможных расцветок, форм и размеров взлетают сегодня в голубое зимнее небо Индии.",
    "date": {
      "day": 14,
      "month": 1
    },
    "category": "Carnivals and festivals",
    "icon": "",
    "notify": true
  }
]